Revit 2027 API
FamilyType Class
The family type object provides read access to the values of family parameters for this type.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.FamilyType
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class FamilyType : APIObject
Public Class FamilyType
	Inherits APIObject
public ref class FamilyType : public APIObject
type FamilyType =
    class
        inherit APIObject
    end
The FamilyType type exposes the following members.
Properties
Name | Description
IsReadOnly | Identifies if the object is read-only or modifiable.
(Inherited from APIObject)
Name | The name of the family type.
Top
Methods
Name | Description
AsDouble | Provides access to the double precision number of the given family parameter.
AsElementId | Provides access to the Autodesk::Revit::DB::ElementId^ stored in the given family parameter.
AsInteger | Provides access to the integer number of the given family parameter.
AsString | Provides access to the string contents of the given family parameter.
AsValueString | Provides access to value as a string with unit in the given family parameter.
Dispose | Causes the object to release immediately any resources it may be utilizing.
(Inherited from APIObject)
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
HasValue | Indicates if this family parameter has an assigned value or not.
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
Autodesk.Revit.DB Namespace